app/views/home/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1  [["category_id", 1]]
---
    <ul id="<%=category.title%>">
      <% category.tasks.each do |task|  %>