app/controllers/tasks_controller.rb

  def new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category
    if @task.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2019-08-28 14:29:58.720893"], ["updated_at", "2019-08-28 14:29:58.720893"], ["title", "Magic Shop"], ["deadline", "2019-08-28 00:00:00"], ["category_id", 2]]